# Assignment 2

### Exercise 1: Basic Dictionary Creation and Access
Objective: Create a dictionary named student_info containing at least three key-value pairs where keys are student names (as strings) and values are their respective ages (as integers). Then, access and print the age of a specific student.

In [1]:
student_info = {"katia":25, "edu": 23, "ana":23, "pame":24}

In [2]:
print(student_info["katia"])

25

### Exercise 2: Modifying Dictionary Values
**Objective:** Start with a dictionary `product_prices` where keys are product names (strings) and values are their prices (floats). Select a product and update its price. Then, add a new product with its price to the dictionary.


### Exercise 3: Dictionary Comprehension
**Objective:** Create a dictionary `squared_numbers` using dictionary comprehension where keys are integers from 1 to 10, and values are the squares of these keys.

### Exercise 4: Nested Dictionaries
**Objective:** Create a nested dictionary `employee_data` where each key is an employee ID (integer) and each value is another dictionary with keys 'Name', 'Position', and 'Salary'. Then, access and print the name and position of a specific employee by their ID. This dictionary `employee_data` should have only 5 keys.

### Exercise 5: Merging Dictionaries
**Objective:** You have two dictionaries `dict1` and `dict2` with non-overlapping keys. Merge these two dictionaries into a new dictionary `merged_dict` and print its contents. This `merged_dict` dict should have all the keys.

In [5]:
# Initial product prices
product_prices = {
    "Laptop": 999.99,
    "Smartphone": 499.99,
    "Headphones": 89.99,
    "Camera": 279.99
}

In [6]:
dict1 = {"A": 1, "B": 2, "C": 3}
dict2 = {"D": 4, "E": 5, "F": 6}

## Ejercicio 2

In [8]:
product_prices["Laptop"] = 1200

In [11]:
product_prices["microphone"] = 100

In [12]:
print(product_prices)

{'Laptop': 1200, 'Smartphone': 499.99, 'Headphones': 89.99, 'Camera': 279.99, 'microphone': 100}

## Ejercicio 3

Pow es una función para calcular la potencia de un número

In [7]:
squared_numbers = { 
    1:pow(1,2),
    2:pow(2,2),
    3:pow(3,2),
    4:pow(4,2),
    5:pow(5,2),
    6:pow(6,2),
    7:pow(7,2),
    8:pow(8,2),
    9:pow(9,2),
    10:pow(10,2),
}

In [8]:
print(squared_numbers)

{1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 6: 36, 7: 49, 8: 64, 9: 81, 10: 100}

## Ejercicio 4

In [11]:
employee_data = {
    1: {"Nombre": "Katia", "Cargo": "Comunicadora", "Salario": 2000},
    2: {"Nombre": "Ana", "Cargo": "Publicista", "Salario": 1900},
    3: {"Nombre": "Edu", "Cargo": "Community_Manager", "Salario": 2100},
    4: {"Nombre": "Pamela", "Cargo": "Comunicadora", "Salario": 2200},
    5: {"Nombre": "Luis", "Cargo": "Diseñador", "Salario": 1300}
}

In [19]:
name = print(employee_data[1]["Nombre"])
position = print(employee_data[1]["Cargo"])

Katia
Comunicadora

## Ejercicio 5

In [20]:
dict1 = {"A": 1, "B": 2, "C": 3}

In [21]:
dict2 = {"D": 4, "E": 5, "F": 6}

Se usa el operador ** para obtener todos los valores del dict 1 y dict 2 para unirlos en un nuevo diccionario

In [23]:
merged_dict = {**dict1, **dict2}

In [24]:
print(merged_dict)

{'A': 1, 'B': 2, 'C': 3, 'D': 4, 'E': 5, 'F': 6}

## Pandas

### Exercise 1: Selecting Single Column with .loc
**Objective**: Use .loc to select and print only the 'Name' column for all rows.

### Exercise 2: Row Slicing with .iloc
**Objective**: Use .iloc to select and print rows 2 through 4 (inclusive).

### Exercise 3: Selecting Multiple Columns with .iloc
**Objective**: Use .iloc to select and print the 'Name' and 'Age' columns for all rows.

### Exercise 4: Conditional Selection with .loc
**Objective**: Use .loc to select and print rows where the 'Age' is greater than 30.

### Exercise 5: Modifying Data with .loc
**Objective**: Use .loc to change the 'City' of the person named 'Alice' to 'Boston'. Then, print the updated DataFrame.

In [1]:
# Creating a DataFrame for the exercise
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 40, 45],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Miami']
}

## Exercise 1

In [2]:
import pandas as pd

In [10]:
pd.DataFrame (data)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston
4      Eva   45        Miami

In [11]:
Table = pd.DataFrame (data)

In [12]:
Table.loc[ 0:4 , ['Name'] ]

      Name
0    Alice
1      Bob
2  Charlie
3    David
4      Eva

## Exercise 2

In [19]:
import pandas as pd

In [20]:
Table = pd.DataFrame (data)

In [41]:
Table.iloc[ 1:4 ]

      Name  Age         City
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston